In [1]:
# import libraries
import numpy as np
import pandas as pd

In [2]:
d={'col1':[1,np.nan,np.nan,np.nan],'col2':[np.nan,np.nan,np.nan,np.nan]}

In [3]:
d

{'col1': [1, nan, nan, nan], 'col2': [nan, nan, nan, nan]}

In [4]:
df=pd.DataFrame(d)

In [5]:
df

   col1  col2
0   1.0   NaN
1   NaN   NaN
2   NaN   NaN
3   NaN   NaN

In [6]:
df.dropna()

Empty DataFrame
Columns: [col1, col2]
Index: []

In [7]:
df

   col1  col2
0   1.0   NaN
1   NaN   NaN
2   NaN   NaN
3   NaN   NaN

In [8]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [10]:
df.dropna(axis=1,how='all')

   col1
0   1.0
1   NaN
2   NaN
3   NaN

In [19]:
df.dropna(axis=0,how='all',thresh=1)

   col1  col2
0   1.0   NaN

In [24]:
df.fillna(value='a')

  col1 col2
0  1.0    a
1    a    a
2    a    a
3    a    a

In [27]:
m=df['col1'].mean()

In [28]:
df.fillna(value=m)

   col1  col2
0   1.0   1.0
1   1.0   1.0
2   1.0   1.0
3   1.0   1.0